Autodesk.Revit.DB.Structure.RebarPresentationMode
Bar presentation mode
Since:
2015
Since:
2015

Autodesk.Revit.DB.Structure.RebarPresentationMode.Select
Selected bars are presented.

Autodesk.Revit.DB.Structure.RebarPresentationMode.Middle
The middle bar is presented.

Autodesk.Revit.DB.Structure.RebarPresentationMode.FirstLast
The first and last bars are presented.

Autodesk.Revit.DB.Structure.RebarPresentationMode.All
All bars are presented.